In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt

In [5]:
from Clean import missing as ms

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/Yimeng-Zhang/feature-engineering-and-feature-selection/master/data/titanic.csv")
data = df[['Pclass', 'Sex', 'Age', 'Fare', 'SibSp', 'Survived']]
data.head()
print(data.shape)

(891, 6)

# Check Missing Data

In [6]:
ms.check_missing(data=data, output_path=None)

          total missing  proportion
Pclass                0    0.000000
Sex                   0    0.000000
Age                 177    0.198653
Fare                  0    0.000000
SibSp                 0    0.000000
Survived              0    0.000000

Feature Age is missing data

# Drop Nan

In [7]:
data2 = ms.drop_missing(data)
data2.shape

(714, 6)

# Them mot cot de the hien du lieu bi thieu

In [8]:
data3 = ms.add_var_denote_NA(data=data, NA_col=['Age'])

In [9]:
data3.head()

   Pclass     Sex   Age     Fare  SibSp  Survived  Age_is_NA
0       3    male  22.0   7.2500      1         0          0
1       1  female  38.0  71.2833      1         1          0
2       3  female  26.0   7.9250      0         1          0
3       1  female  35.0  53.1000      1         1          0
4       3    male  35.0   8.0500      0         0          0

In [10]:
data3.Age_is_NA.value_counts()

0    714
1    177
Name: Age_is_NA, dtype: int64

# Dien gia tri tuy y

In [11]:
data4 = ms.impute_NA_with_arbitrary(data=data, impute_value=-999, NA_col=['Age'])
data4.head()

   Pclass     Sex   Age     Fare  SibSp  Survived  Age_-999
0       3    male  22.0   7.2500      1         0      22.0
1       1  female  38.0  71.2833      1         1      38.0
2       3  female  26.0   7.9250      0         1      26.0
3       1  female  35.0  53.1000      1         1      35.0
4       3    male  35.0   8.0500      0         0      35.0

# Impute follow distribution

In [12]:
data5 = ms.impute_NA_with_end_of_distribution(data=data, NA_col=['Age'])
data5.head()

   Pclass     Sex   Age     Fare  SibSp  Survived  Age_impute_end_of_distri
0       3    male  22.0   7.2500      1         0                      22.0
1       1  female  38.0  71.2833      1         1                      38.0
2       3  female  26.0   7.9250      0         1                      26.0
3       1  female  35.0  53.1000      1         1                      35.0
4       3    male  35.0   8.0500      0         0                      35.0